---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeOutOfPlaneBendDiameter
source: html/b7ed9da8-dc84-234c-d8b2-ce7e92a59635.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeOutOfPlaneBendDiameter Property

"Out of Plane Bend Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeOutOfPlaneBendDiameter { get; }
```